In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'a':[1,2,np.nan],
                 'b':[4,np.nan,np.nan],
                 'c':[7,8,9]})

In [3]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [4]:
df.dropna()

     a    b  c
0  1.0  4.0  7

In [5]:
df.dropna(axis=1)

   c
0  7
1  8
2  9

In [6]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [7]:
df.dropna(axis=1,thresh=2)

     a  c
0  1.0  7
1  2.0  8
2  NaN  9

In [8]:
df.fillna(value='Fill value')

            a           b  c
0           1           4  7
1           2  Fill value  8
2  Fill value  Fill value  9

In [9]:
df.fillna(value=df.mean())

     a    b  c
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9

In [11]:
df['a'].fillna(value=df['c'].mean(),inplace=True)

In [12]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  8
2  8.0  NaN  9